[
  {
    "name": "GitOps",
    "quadrant": "techniques",
    "ring": "adopt",
    "isNew": "FALSE",
    "description": "GitOps is a technique for deploying applications via the <a href='https://kubernetes.io/docs/concepts/architecture/controller/'>control loop</a> pattern. An operator keeps the deployed application synchronized with configuration, usually a Git repository. <a href='https://github.com/open-gitops/documents/blob/main/PRINCIPLES.md'>GitOps</a> can be seen as a way of implementing infrastructure as code that involves continuously synchronizing and applying infrastructure code from Git into various environments. GitOps is a useful technique that takes advantage of the functionality of our Kubernetes clusters and creates opportunities to separate concerns between configuring an application and the implementation of the deployment process."
  },
  {
    "name": "Automatic merging of dependency update PRs",
    "quadrant": "techniques",
    "ring": "assess",
    "isNew": "FALSE",
    "description": "The complexity of the software supply chain is a major risk, as addressed by <a href='https://www.crowdstrike.com/cybersecurity-101/secops/software-bill-of-materials-sbom/'>SBOM</a> and <a href='https://slsa.dev/'>SLSA</a>. The Achilles heel for most teams is still the presence of vulnerabilities in dependencies, often indirect dependencies several levels down. Tools such as Dependabot help by creating pull requests (PRs) to update dependencies. It requires engineering discipline, though, to look after these PRs promptly, especially when they are for applications or services that are not under active development.<br><br> Under the right circumstances we now advocate for automatic merging of dependency update PRs. This requires that the system has extensive test coverage — not only unit tests but also functional and performance tests. The build pipeline must run all of these tests, and it must include security scanning. In short, the team must have full confidence that when the pipeline runs successfully the software is ready to go into production. In such cases, dependency update PRs, even when they include major version updates in indirect dependencies, should be merged automatically."
  },
  {
    "name": "Web Component-based Design Systems",
    "quadrant": "techniques",
    "ring": "adopt",
    "isNew": "FALSE",
    "description": "As application development becomes increasingly dynamic and complex, we leverage design systems centered around web components and Snap UI Toolkit (SUIT) to ensure a cohesive product experience across our expanding portfolio. As our organization grows through acquisitions, SUIT's shared library is crucial for maintaining usability, accessibility, and stylistic consistency across diverse products. By adopting a product-centric mindset and fostering collaboration with our teams, we prioritize seamless integration and consistency, ensuring our design system meets the evolving needs of our team and maintains a unified user experience."
  },
  {
    "name": "JavaScript-based Design Systems",
    "quadrant": "techniques",
    "ring": "assess",
    "isNew": "FALSE",
    "description": "With the high level of adoption of the Snap UI Toolkit (SUIT) across a majority of our products, we're transitioning towards dynamic JavaScript runtimes to address the limitations of web component-based systems, particularly their integration challenges with frontend frameworks and the issues they have with server-side rendering. This evolution of SUIT will leverage dynamic JavaScript-based components to ensure a more adaptable and seamless integration across our projects. As our team continues to grow, incorporating new acquisitions, this strategic shift guarantees that SUIT remains central to delivering a unified, accessible, and stylistically consistent user experience."
  },
  {
    "name": "CI/CD via Feature Toggles",
    "quadrant": "techniques",
    "ring": "adopt",
    "isNew": "FALSE",
    "description": "Achieving true Continuous Deployment (CD) in our CI/CD processes, particularly for legacy applications with limited test coverage, necessitates the adoption of Feature Toggles. This approach resolves the challenge of safely implementing continuous updates by allowing us to selectively activate new features, ensuring operational stability and user satisfaction without the need for push-button deployments. A key aspect of this approach includes minimizing the use of dev and staging environments, and aligning staging deployments in lockstep with production. The critical distinction between staging and production lies in the activation state of the feature toggles—active in one environment and inactive in the other. This method ensures a seamless, controlled rollout of new features, maintaining system stability and enhancing our deployment efficiency across projects. Feature Toggles have become crucial at Snap to maintain the pace and reliability of our deployments across teams."
  },
  {
    "name": "NIST 2.0",
    "quadrant": "techniques",
    "ring": "adopt",
    "isNew": "TRUE",
    "description": "The NIST Cybersecurity Framework (CSF) 2.0 provides guidance to industry, government agencies, and other organizations to manage cybersecurity risks"
  },
  {
    "name": "Pre Mortem Exercises",
    "quadrant": "techniques",
    "ring": "adopt",
    "isNew": "FALSE",
    "description": "We've adopted Pre Mortem Exercises as a proactive measure to anticipate and mitigate potential failures before they occur. This <a href='https://en.wikipedia.org/wiki/High_reliability_organization'>HRO-driven approach</a> involves systematically envisioning and analyzing potential setbacks or disasters, enabling our teams to identify and address vulnerabilities in advance. We conduct these exercises prior to any large release or deployment in order to foster a culture of vigilance and preparedness. Pre Mortem Exercises not only help in refining our strategies and operations but also reinforce our commitment to excellence and continuous improvement, essential traits of an HRO."
  },
  {
    "name": "Software Load Testing",
    "quadrant": "techniques",
    "ring": "trial",
    "isNew": "FALSE",
    "description": "Recognizing the challenges we've faced in identifying performance bottlenecks in our past projects, the necessity of Software Load Testing has become increasingly clear. This allows us to simulate high-usage conditions to ensure our applications can handle expected traffic volumes and interactions without degradation in performance. By integrating Software Load Testing into our development lifecycle, we aim to preemptively identify and address potential issues, enhancing the robustness and scalability of our systems."
  },
  {
    "name": "Elixir",
    "quadrant": "languages & frameworks",
    "ring": "assess",
    "isNew": "TRUE",
    "description": "<a href='https://www.rust-lang.org/'><b>Elixir</b></a> is an elegant functional programming language focusing on concurrency, fault tolerance, and developer productivity, alongside a vibrant community and ecosystem. It has a lightweight process model, enabling millions of processes to run concurrently on the same virtual machine. Elixir leverages the Erlang VM, which is a language proven in its fault tolerance and used to power communications across global satellite and telecommunication networks. Its <a href='https://www.phoenixframework.org/'><b>Phoenix</b></a> web framework is designed for high productivity and maintainability, making the best use of Elixir's concurrent features."
  },
  {
    "name": "Rust",
    "quadrant": "languages & frameworks",
    "ring": "assess",
    "isNew": "TRUE",
    "description": "<a href='https://www.rust-lang.org/'><b>Rust</b></a> has emerged as a powerful programming language that we are looking to add to our arsenal, distinguished by its unparalleled emphasis on safety, speed, and concurrency. Rust's ownership model eliminates common bugs associated with memory management and concurrency, allowing for more reliable and efficient code. Its performance is comparable to languages like C, without sacrificing safety, making it an ideal choice for performance-critical applications. Furthermore, Rust's vibrant ecosystem and comprehensive tooling support foster rapid development and maintainability. We are moving Rust to 'Trial' as we think adopting Rust not only enhances our codebase's safety and performance but also aligns with our commitment to building robust, high-quality systems."
  },
  {
    "name": "Playwright",
    "quadrant": "languages & frameworks",
    "ring": "trial",
    "isNew": "TRUE",
    "description": "<a href='https://playwright.dev/'><b>Playwright</b></a> allows you to write Web UI tests for Chromium and Firefox as well as WebKit, all through the same API. The tool has gained some attention for its support of all the major browser engines which it achieves by including patched versions of Firefox and Webkit. We continue to hear positive experience reports with Playwright, in particular its stability. Teams have also found it easy to migrate from <a href='https://www.thoughtworks.com/en-us/radar/languages-and-frameworks/puppeteer'>Puppeteer</a>, which has a very similar API."
  },
  {
    "name": "K6 Load Testing",
    "quadrant": "languages & frameworks",
    "ring": "trial",
    "isNew": "TRUE",
    "description": "<a href='https://k6.io/'><b>K6</b></a> distinguishes itself as a load testing tool through its developer-centric design and its capability to simulate complex user behaviors and traffic patterns, offering more nuanced insight into system performance under various stress conditions. With its ability to send telemetry data to <a href='https://k6.io/docs/results-output/real-time/new-relic/'>New Relic</a>, K6 also facilitates real-time performance monitoring. By moving K6 into 'Trial' within our development workflow, we are not only aiming to boost our applications' efficiency but also to ensure the robustness of our systems."
  },
  {
    "name": "Next.js",
    "quadrant": "languages & frameworks",
    "ring": "trial",
    "isNew": "FALSE",
    "description": "As <a href='https://nextjs.org/'><b>Next.js</b></a> ascends to become the official framework of React, we are strategically aligning with the framework by trialing Next as part of our tech stack. This decision is propelled by the JavaScript community's shift towards Server-Side Rendering (SSR) as the emerging development for JavaScript applications. Next.js stands to provide additional performance and SEO benefits to our web applications.<br><br>As we explore incorporating Next into our applications, we anticipate facing upcoming challenges, particularly around our Snap UI Toolki (SUIT) and Next's incorporation with NX. We're taking additional care towards evaluating the benefits of SSR-rendered applications versus a traditionally split frontend and backend architecture as we look to incorporate other backend languages into our stack."
  },
  {
    "name": "NX",
    "quadrant": "languages & frameworks",
    "ring": "trial",
    "isNew": "FALSE",
    "description": "<a href='https://nx.dev/'><b>NX</b></a> has become the dominant tool to faciliate the monorepo pattern and has overtaken Lerna as the defacto standard. The JavaScript monorepo pattern (not to be confused with Git monorepos) has proven itself to be a more maintainable architecture for managing large codebases and maintaining strong separation of concerns. It has been battle tested in its use in prominent codebases like React, Babel, Angular and Jest. The pattern works by creating shippable services composed of shared sub-packages within the repository. These shared packages are housed within the repository using the standard NPM package format. NX provides a framework and a set of tooling that assists in managing your publishing process and eliminates much of the ceremony that comes with vendoring sub-packages by distributing commands across all dependencies during the development and build process."
  },
  {
    "name": "OpenTelemetry",
    "quadrant": "languages & frameworks",
    "ring": "trial",
    "isNew": "FALSE",
    "description": "<a href='https://opentelemetry.io/'><b>OpenTelemetry</b></a> is an open source observability project that merges <a href='https://opentracing.io/'>OpenTracing</a> and <a href='https://github.com/census-instrumentation'>OpenCensus</a>. The OpenTelemetry project includes <a href='https://github.com/open-telemetry/opentelemetry-specification'>specification</a>, libraries, agents, and other components needed to capture telemetry from services to better observe, manage and debug them. It covers the three pillars of observability — distributed tracing, metrics and logging — and its specification connects these three pieces through <a href='https://github.com/open-telemetry/opentelemetry-specification/blob/master/specification/correlationcontext/api.md'>correlations</a>; thus you can use metrics to pinpoint a problem, locate the corresponding traces to discover where the problem occured, and ultimately study the corresponding logs to find the exact root cause. OpenTelemetry components can be connected to back-end observability systems such as Prometheus and Jaeger among others. Formation of OpenTracing is a positive step toward the convergence of standardization and the simplification of tooling. Many proprietary logging vendors like NewRelic and DataDog, are now providing support for OpenTelemetry. This could pose a potential boone to Snap, as its eliminates our dependence on specific log aggregation vendors."
  },
  {
    "name": "Prisma ORM",
    "quadrant": "tools",
    "ring": "adopt",
    "isNew": "FALSE",
    "description": "<a href='https://www.prisma.io/'><b>Prisma</b></a> aims to solve the problems of traditional Node.js ORMs by providing a clean API with declarative schemas, and type-safety. It focuses on queries as JSON data structures and returns plain old JavaScript objects. Snap has seen great success with Prisma and recommends its adoption across the Engineering organization.<br><br>Traditional ORMs abstract away from SQL by letting you define your application models as <i>classes</i>, but the mental model you have for your data is that of an <i>object</i>. However, the mental model for data in SQL are <i>tables</i>. The divide between these different representations of data is often referred to as the 'object-relational impedance mismatch'. While the premise is great, it's based on the wrong assumption that relational data can easily be mapped to objects which leads to lots of complications and pitfalls. Prisma offers a different take that aims to address these issues."
  },
  {
    "name": "prisma-repo-next",
    "quadrant": "languages & frameworks",
    "ring": "assess",
    "isNew": "TRUE",
    "description": "While we like Prisma, it is also lacking in many areas. In particular Prisma encourages calling queries directly throughout your codebase, making it an unwieldy foot gun. The repository pattern can alleviate this by providing an abstraction that sits between our data models and our data persistence layer. <a href='https://github.com/krsbx/prisma-repo-next'><b>prisma-repo-next</b></a> is a library that automatically generates a repository in the same vein as Ecto or ActiveRecord. We're hoping this cleans up the architecture in our projects a bit, as only through the clearly defined 'repository' interface are you able to interact with your data persistence layer. With this approach, all database queries lie only inside the repository and the caller is not burdened with the implementation details of how the repository interacts with the database (or with external APIs)."
  },
  {
    "name": "Snyk",
    "quadrant": "tools",
    "ring": "hold",
    "isNew": "FALSE",
    "description": "<a href='https://snyk.io/'><b>Snyk</b></a> provides both static application security testing (SAST) and software component analysis (SCA) tests to help you find, fix and monitor security issues throughout the software development lifecycle. Its broad range of features is designed to speed up the feedback loop, favoring a shift-left approach instead of the <a href='https://www.thoughtworks.com/en-us/radar/techniques/security-sandwich'>security sandwich anti-pattern</a>. As one of the best security platforms available today, Snyk stands out because of its ability to identify a wider range of issues, enabled mainly by a <a href='https://docs.snyk.io/scan-application-code/snyk-open-source/starting-to-fix-vulnerabilities/using-the-snyk-vulnerability-database'>dedicated research team adding to its vulnerability database</a>. But there's room for improvement: the dashboard currently doesn't provide an easy way to filter noise down to specific actionable information; depending on the language ecosystem, SCA-based integrations can output false positives compared to pipeline-based integrations because Snyk has to guess what the resolved dependencies are; automated resolution is not consistently successful; and significant integration investment is required in order to achieve proper gatekeeping or to establish an SBOM in high regulatory environments. Despite these shortcomings, Snap recommends the adoption of Snyk across the organization."
  },
  {
    "name": "Nuclei",
    "quadrant": "tools",
    "ring": "assess",
    "isNew": "FALSE",
    "description": "<a href='https://projectdiscovery.io/nuclei'><b>Nuclei</b></a> is a promising and open source alternative that provides DAST scanning using a modern declarative Git-based approach. The team is currently assessing Nuclei as a viable alternative to StackHawk. While the team currently uses <a href='https://www.stackhawk.com/'>StackHawk</a> to provide automated DAST scanning, it suffers from shortcomings and ultimately appears to provide a veneer over running <a href='https://www.zaproxy.org/'>OWASP Zap</a> (with preconfigured settings enabled)."
  },
  {
    "name": "ScaleFusion MDM",
    "quadrant": "tools",
    "ring": "hold",
    "isNew": "FALSE",
    "description": "We currently use <a href='https://scalefusion.com/'><b>ScaleFusion</b></a> to provide MDM capability to our mobile iOS and iPad devices, however its rollout is fret with issues and we're interestd in alternatives. The team would recommend holding on further adoption of ScaleFusion MDM as we evaluate options like <a href='https://micromdm.io/'><b>MicroMDM</b></a>."
  },
  {
    "name": "Bruno and Alternative(s)",
    "quadrant": "tools",
    "ring": "trial",
    "isNew": "TRUE",
    "description": "With increasing occurrence of paywalls, cloud logins, and commercial restrictions being imposed by tools like Postman and Insomnia, applications like <a href='https://www.usebruno.com/'><b>Bruno</b></a>, <a href='https://www.thunderclient.com/'><b>Thunder Client</b></a>, and <a href='https://hoppscotch.io/'>Hoppscotch</b></a> provide promising open source API clients and a viable alternative to commercial API clients. The team currently recommends that developers trial Bruno and other open source alternatives to avoid commercial licensing issues."
  },
  {
    "name": "Teleport",
    "quadrant": "tools",
    "ring": "trial",
    "isNew": "TRUE",
    "description": "<a href='https://goteleport.com/'><b>Teleport</b></a> is a tool for zero trust network access to infrastructure. Traditional setups require complex policies or jump servers to restrict access to critical resources. Teleport, however, simplifies this with a unified access plane and with fine-grained authorization controls that replace jump servers, VPNs or shared credentials. Implemented as a single binary with out-of-the-box support for several protocols (including SSH, RDP, Kubernetes API, MySQL, MongoDB and PostgreSQL wire protocols), Teleport makes it easy to set up and manage secured access across Linux, Windows or Kubernetes environments. We have seen a few companies in the security space adopt Teleport with great success and the overall positive experience prompted us to move it into trial stages."
  },
  {
    "name": "Fleet MDM",
    "quadrant": "tools",
    "ring": "trial",
    "isNew": "TRUE",
    "description": "<a href='https://fleetdm.com/'><b>Fleet</b></a> provides vulnerability reporting, detection engineering, device management (MDM), device health monitoring, posture-based access control, managing unused software licenses, and more. We like that Fleet is developer-focused and designed with APIs, GitOps, and webhooks in mind. We are currently moving Fleet into trial stages within the team. Snap today does not deploy or maintain MDM on laptop and desktop devices. To further our pursuit of the zero-trust security model, the team is evaluating the adoption of MDM tooling in this space. "
  },
  {
    "name": "Wazuh",
    "quadrant": "tools",
    "ring": "trial",
    "isNew": "TRUE",
    "description": "While we employ tools like <a href='https://www.cloudflare.com/zero-trust/products/email-security/'>CloudFlare Area 1</a> and <a href='https://www.lacework.com/'>Lacework</a> to detect compromised accounts, there is an increasing need for on-device tools to provide earlier awareness of compromised activity. <a href='https://wazuh.com/'><b>Wazuh</b></a> is an open source tool that logs on-device system information, like network activity, local user authentication, and removable media usage. It can then be used to detect threats and anomalous behavior both in realtime and as a forensics tool after a device has been compromised."
  },
  {
    "name": "AI-assisted Coding",
    "quadrant": "tools",
    "ring": "assess",
    "isNew": "TRUE",
    "description": "We are currently assessing the adoption of AI-assisted coding tools like <a href='https://github.com/features/copilot'><b>Github Copilot</b></a>, <a href='https://chat.openai.com/'><b>ChatGPT</b></a>, <a href='https://codeium.com/'><b>Codeium</b></a>, and <a href='https://aws.amazon.com/codewhisperer/'><b>AWS Codewhisperer</b></a>. Some challenges we aim to address during the assessments of these tools are: package and API hallucination vulnerabilities, ensuring that Snap's code style and quality standards are maintained as there is data to show that coding tools lower overall code quality, protecting Snap's intellectual property and ensuring we are not vulnerable to licensing issues."
  },
  {
    "name": "Postman and Insomnia",
    "quadrant": "tools",
    "ring": "hold",
    "isNew": "FALSE",
    "description": "<a href='https://www.postman.com/'><b>Postman</b></a> and <a href='https://insomnia.rest/'><b>Insomnia</b></a>, while sophisticated API GUI Clients, have become increasingly adversarial with nagware, holding data ransom, and anti-commercial licensing. Refrain from using Postman or Insomnia as there are a variety of rich open source alternatives. (see Bruno and ThunderClient)"
  },
  {
    "name": "PNPM",
    "quadrant": "tools",
    "ring": "trial",
    "isNew": "TRUE",
    "description": "<a href='https://pnpm.io/'><b>pnpm</b></a> is an up-and-coming package manager for Node.js that we're moving to trials because of its higher speed and greater efficiency compared to other package managers. Dependencies are saved in a single place on the disk and are linked into the respective node_modules directories. pnpm also supports incremental optimization on file level, provides a solid API foundation to allow extension/customization and supports store server mode, which speeds up dependency download even more. We were initially concerned about using an alternative to NPM, as our experience has shown that NPM tends to find a way back in the project. But PNPM ships with NPM hooks that prevent NPM from running on projects once set up. Given that our team has a large number of projects with the same dependencies, pnpm might be a good choice. We are also trialing its use in Docker and Github Actions builds."
  },
  {
    "name": "Keycloak",
    "quadrant": "tools",
    "ring": "assess",
    "isNew": "FALSE",
    "description": "<a href='https://www.keycloak.org/'><b>Keycloak</b></a> is an open source identity and access management solution that makes it easy to secure applications or microservices with little to no code. It has nearly all of the features provided by Okta with out of the box support for single sign-on, social login, and standard protocols such as OpenID Connect, OAuth2 and SAML. Our team is currently assessing Keycloak as an internal tool to act as an open source replacement for Okta. We are also evaluating its use as a 3rd-party auth bridge for our User Directory service."
  },
  {
    "name": "Docker Desktop and OrbStack",
    "quadrant": "platforms",
    "ring": "hold",
    "isNew": "FALSE",
    "description": "<a href='https://www.docker.com/products/docker-desktop/'><b>Docker Desktop</b></a> is increasingly adding paid enterprise features and has modified its licensing terms so that it can not be used for commercial projects. Use of Docker Desktop is prohibited and against Docker's licensing terms. Please trial open source solutions like Colima and Podman. Likewise, <a href='https://orbstack.dev/'><b>OrbStack</b></a> is another Docker Desktop alternative that expressly forbids free use to build commercial projects. Avoid using OrbStack."
  },
  {
    "name": "Crossplane",
    "quadrant": "platforms",
    "ring": "trial",
    "isNew": "TRUE",
    "description": "<a href='https://www.crossplane.io/'><b>Crossplane</b></a> is a CNCF-backed platform that evolves beyond Terraform to introduce a Kubernetes-native approach to infrastructure management. It eliminates the need to manage Terraform state files or manual build and reconciliation processes and enables provisioning of cloud infrastructure (like RDS databases) and 3rd party services directly through Kubernetes APIs. Crossplane allows for the creation of custom resource definitions to abstract cloud services across providers. Unlike Terraform, Crossplane also leverages the power of Kubernetes to provide continuous reconciliation and self-healing capabilities. In light of recent efforts by HashiCorp to increasingly commercialize Terraform and restrict its commercial licensing, shifting to Crossplane offers a significant advantage over the traditional Terraform approach by simplifying deployment and maintenance of cloud-native services."
  },
  {
    "name": "Argo CD",
    "quadrant": "platforms",
    "ring": "trial",
    "isNew": "TRUE",
    "description": "<a href='https://argoproj.github.io/cd/'><b>Argo</b></a> has emerged as the defacto standard for CI/CD in Kubernetes with Kubernetes polls showing a 4 to 1 adoption ratio over Flux. Argo CD also provides a developer-friendly build system and UI, making it possible to use Argo entirely without the use intermediary build runners like Circle CI or Github Actions. Given the turmoil that the Flux project has gone through with its primary contributor (WeaveWorks) no longer maintaining the project, it is a good time for the team to explore the adoption of Argo. Argo also has an advantage in that it provides tooling that can handle data science and ML workloads in addition to CI/CD."
  },
  {
    "name": "Kargo",
    "quadrant": "platforms",
    "ring": "assess",
    "isNew": "TRUE",
    "description": "<a href='https://akuity.io/what-is-kargo/'><b>Kargo</b></a> is a next-generation continuous delivery and application lifecycle orchestration platform that builds upon Argo and uses GitOps principles to streamline and automate the progressive rollout of changes across the many stages of an application's lifecycle. It provides a layer that is able to track the lifecycle of an application across dev/staging/production rollouts and across multiple clusters. It also provides a friendly user interface to visualize, rollback, and promote an application across these stages."
  },
  {
    "name": "Colima",
    "quadrant": "platforms",
    "ring": "trial",
    "isNew": "TRUE",
    "description": "<a href='https://github.com/abiosoft/colima'><b>Colima</b></a> has become the go-to alternative to Docker Desktop on macOS for many dev teams. We'd be remiss not to trial Colima alongside Podman.  Colima is used to provision the Docker container run time in a <a href='https://github.com/lima-vm/lima'>Lima VM</a>, to configure the Docker CLI on macOS and to handle port-forwarding and volume mounts. Colima can be configured to run <a href='https://containerd.io/'>containerd</a> as its run time, which is also the run time on most managed Kubernetes services, improving the important dev-prod parity."
  },
  {
    "name": "Temporal",
    "quadrant": "platforms",
    "ring": "adopt",
    "isNew": "FALSE",
    "description": "<a href='https://temporal.io/'><b>Temporal</b></a> is a platform for developing long-running workflows, particularly for microservice architectures. A fork of Uber's previous OSS Cadence project, it has an event-sourcing model for long-running workflows so they can survive process/machine crashes. Building off the backs of past orchestration services, Temporal takes a different approach by focusing on orchestration over choreography and writing logic within your own tech stack."
  },
  {
    "name": "AWS Lambda and Serverless Functions",
    "quadrant": "platforms",
    "ring": "hold",
    "isNew": "FALSE",
    "description": "We enforce deployment and CI/CD standards following best practices in Kubernetes. Teams should avoid using Serverless as they receive limited support from Snap and lack many quality control checks. While AWS Lambda is easy to deploy, we've seen that teams when teams deploy serverless to production, their projects have lacked QC build processes, observability, database connection management, GraphQL federation, network routing, and many security features that our Kubernetes systems provide out of the box."
  },
  {
    "name": "Podman",
    "quadrant": "platforms",
    "ring": "trial",
    "isNew": "FALSE",
    "description": "<a href='https://podman-desktop.io/'><b>Podman</b></a> is a free and open source alternative to Docker + Docker Desktop. Podman has a different conceptual approach to containers. As hinted by the name, Podman can create container <i>'pods'</i> that work together, a feature resembling the Kubernetes pods. Pods organize separate containers under a common denomination to manage them as single units. Another defining feature of Podman is that it is daemon-less."
  },
  {
    "name": "DevSpace",
    "quadrant": "platforms",
    "ring": "trial",
    "isNew": "TRUE",
    "description": "<a href='https://www.devspace.sh/'><b>DevSpace</b></a> is a competitor to <a href='https://tilt.dev/'>Tilt</a> (now Docker owned) and <a href='https://skaffold.dev/'>Skaffold</a> (Google). It is created by the team behind <a href='https://devpod.sh/'>DevPod</a> (Github Workspace alternative). DevSpace allows working in a complete local or remote dev environment configured for your team and automates all the steps from a code change to a new process: watching files, building container images, and bringing your environment up-to-date. Whereas other tools focused on providing file or container-based development, DevSpace provides all virtual services and databases needed for a complete working environment with hotreload capability. We were previously looking into Tilt but were concerned with its recent acquisition by Docker. We are moving DevSpace into trial given that it allows both remote developent, and native Kubernetes-based development, allowing developers to work in an 'as close to production' environment as possible."
  },
  {
    "name": "Amazon RDS",
    "quadrant": "platforms",
    "ring": "adopt",
    "isNew": "FALSE",
    "description": "Amazon RDS (Relational Database Service) is a managed relational database service offered by Amazon Web Services, providing easy setup, scaling, and administration of various database engines in the cloud."
  },
  {
    "name": "Neo4j",
    "quadrant": "platforms",
    "ring": "adopt",
    "isNew": "FALSE",
    "description": "Neo4j is a graph database management system designed for efficient storage and querying of interconnected data, utilizing graph structures to represent and navigate relationships between entities."
  },
  {
    "name": "Redis",
    "quadrant": "platforms",
    "ring": "adopt",
    "isNew": "FALSE",
    "description": "Redis is an open-source, in-memory data structure store known for its high performance, versatility, and support for various data structures, commonly used as a caching, messaging, and real-time analytics solution."
  },
  {
    "name": "Twilio",
    "quadrant": "platforms",
    "ring": "adopt",
    "isNew": "FALSE",
    "description": "Twilio is a cloud communications platform that enables developers to integrate messaging, voice, and video capabilities into their applications via APIs, facilitating seamless customer engagement experiences. We leverage Twilio for SMS Messages."
  },
  {
    "name": "SendGrid",
    "quadrant": "platforms",
    "ring": "adopt",
    "isNew": "FALSE",
    "description": "SendGrid is a cloud-based email service provider that offers scalable email delivery solutions and analytics to help businesses effectively manage and optimize their email communication strategies."
  },
  {
    "name": "Hive GraphQL",
    "quadrant": "platforms",
    "ring": "adopt",
    "isNew": "FALSE",
    "description": "Hive GraphQL is a query language and runtime for APIs that simplifies data retrieval and manipulation by providing a unified interface for accessing various data sources, optimizing efficiency and developer productivity."
  },
  {
    "name": "Magento",
    "quadrant": "platforms",
    "ring": "adopt",
    "isNew": "FALSE",
    "description": "Magento is an open-source e-commerce platform known for its robust features, flexibility, and scalability, empowering businesses to create and manage online stores with ease."
  },
  {
    "name": "Magento",
    "quadrant": "platforms",
    "ring": "adopt",
    "isNew": "FALSE",
    "description": "Magento is an open-source e-commerce platform known for its robust features, flexibility, and scalability, empowering businesses to create and manage online stores with ease."
  },
  {
    "name": "Cloudflare Workers",
    "quadrant": "platforms",
    "ring": "adopt",
    "isNew": "FALSE",
    "description": "Used for image overlay processing for Store."
  },
  {
    "name": "Cloudflare Workers",
    "quadrant": "platforms",
    "ring": "adopt",
    "isNew": "FALSE",
    "description": "Used for image overlay processing for Store."
  },
  {
    "name": "Cloudflare Area1",
    "quadrant": "tools",
    "ring": "adopt",
    "isNew": "FALSE",
    "description": "Cloudflare Area 1 is a cybersecurity platform offering advanced threat protection against email-based attacks, such as phishing and malware, by leveraging AI-driven detection and real-time threat intelligence."
  },
  {
    "name": "Amazon ELB",
    "quadrant": "platforms",
    "ring": "adopt",
    "isNew": "FALSE",
    "description": "Amazon ELB (Elastic Load Balancing) is a managed service that automatically distributes incoming application traffic across multiple targets, such as EC2 instances or containers, to ensure high availability and scalability of web applications."
  }
]
